Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНоменклатуры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;	
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Сумма = ТекСтрока.Количество * ТекСтрока.Цена;	
	ТоварыСтавкаНДСПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСуммаПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	ТекСтрока.Цена = ТекСтрока.Сумма / ТекСтрока.Количество;
	СуммаНовая = ТекСтрока.Сумма;	
	Если Объект.СуммаВключаетНДС = Ложь Тогда
		Если ТекСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
			ТекСтрока.СуммаНДС = СуммаНовая / 6;
			СуммаБезНДС = СуммаНовая - ТекСтрока.СуммаНДС;
			ТекСтрока.Цена = СуммаБезНДС / ТекСтрока.Количество;
		ИначеЕсли ТекСтрока.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
			ТекСтрока.СуммаНДС = СуммаНовая / 12;
			СуммаБезНДС = СуммаНовая - ТекСтрока.СуммаНДС;
			ТекСтрока.Цена = СуммаБезНДС / ТекСтрока.Количество;
		КонецЕсли;	
	Иначе
		ТоварыСтавкаНДСПриИзменении(Элемент);
		ТекСтрока.Сумма = СуммаНовая;
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Функция ПересчитатьСуммуНДС(Цена, Количество, СтавкаНДС, СуммаСНДС)
	СуммаНДС = 0;
	//Сумма вкл НДС
	Если Объект.СуммаВключаетНДС = Истина Тогда
		//Ставка 20
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		СуммаНДС = ((Цена * Количество) / 6);
		КонецЕсли;
		//Ставка 10
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		СуммаНДС = ((Цена * Количество) / 12);
		КонецЕсли;
		//Без НДС
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		СуммаНДС = 0;
		КонецЕсли;
	    Возврат СуммаНДС;
	//Сумма не вкл НДС	
	Иначе
		//Ставка 20
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		СуммаНДС = ((Цена * Количество) * 0.2);
		КонецЕсли;
		//Ставка 10
		Если СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		СуммаНДС = ((Цена * Количество) * 0.1);
		КонецЕсли;
		//Без НДС
		Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		СуммаНДС = 0;
		КонецЕсли;
	    Возврат СуммаНДС;
	КонецЕсли;					
КонецФункции

&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Цена = ТекСтрока.Цена;
	Количество = ТекСтрока.Количество;
	СтавкаНДС = ТекСтрока.СтавкаНДС;
	СтароеНДС = ТекСтрока.СуммаНДС;
	ТекСтрока.СуммаНДС = ПересчитатьСуммуНДС(Цена, Количество, СтавкаНДС, Объект.СуммаВключаетНДС);
	Если Объект.СуммаВключаетНДС = Ложь Тогда
		ТекСтрока.Сумма = Количество * Цена + ТекСтрока.СуммаНДС;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура СуммаВключаетНДСПриИзменении(Элемент)
		Для Каждого ТекСтрокаНоменклатура Из Объект.Товары Цикл
			Если Объект.СуммаВключаетНДС = Истина Тогда
				Если ТекСтрокаНоменклатура.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
					ТекСтрокаНоменклатура.Сумма = (ТекСтрокаНоменклатура.Сумма * 100) / 120;
					ТекСтрокаНоменклатура.СуммаНДС = ТекСтрокаНоменклатура.Сумма / 6; 
				ИначеЕсли ТекСтрокаНоменклатура.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда	
					ТекСтрокаНоменклатура.Сумма = (ТекСтрокаНоменклатура.Сумма * 100) / 120;
					ТекСтрокаНоменклатура.СуммаНДС = ТекСтрокаНоменклатура.Сумма / 12; 					
				КонецЕсли;								
			Иначе
				Если ТекСтрокаНоменклатура.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
					ТекСтрокаНоменклатура.СуммаНДС = ТекСтрокаНоменклатура.Сумма * 0.2; 
					ТекСтрокаНоменклатура.Сумма = ТекСтрокаНоменклатура.Сумма * 1.2;
				ИначеЕсли ТекСтрокаНоменклатура.СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда	
					ТекСтрокаНоменклатура.СуммаНДС = ТекСтрокаНоменклатура.Сумма * 0.1; 
					ТекСтрокаНоменклатура.Сумма = ТекСтрокаНоменклатура.Сумма * 1.1;					
				КонецЕсли;				
			КонецЕсли;			
		КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура)
	НоваяНоменклатура = Справочники.Номенклатура.НайтиПоНаименованию(Номенклатура).ПолучитьОбъект();
	СтавкаНДС = НоваяНоменклатура.НДС;
	Возврат СтавкаНДС;
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекСтрока = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	Номенклатура = ТекСтрока.Номенклатура;
	ТекСтрока.СтавкаНДС = ТоварыНоменклатураПриИзмененииНаСервере(Номенклатура);
КонецПроцедуры
